Revit 2027 API
NumberingFormatSettings(NumberingFormatSettings) Constructor
 Copy a parameter and its association.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumberingFormatSettings(
	NumberingFormatSettings other
)
Public Sub New (
	other As NumberingFormatSettings
)
public:
NumberingFormatSettings(
	NumberingFormatSettings^ other
)
new :
        other : NumberingFormatSettings -> NumberingFormatSettings
Parameters
other NumberingFormatSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingFormatSettings Class
NumberingFormatSettings Overload
Autodesk.Revit.DB Namespace